Revit 2026 API

# UnitUtilsIsUnit Method

---

Checks whether a ForgeTypeId identifies a unit.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static bool IsUnit(
	ForgeTypeId unitTypeId
)
```
```vb
Public Shared Function IsUnit (
	unitTypeId As ForgeTypeId
) As Boolean
```
```cpp
public:
static bool IsUnit(
	ForgeTypeId^ unitTypeId
)
```
```fsharp
static member IsUnit :
        unitTypeId : ForgeTypeId -> bool
```

#### Parameters

unitTypeId ForgeTypeId
     The identifier to check.

#### Return Value

Boolean True if the ForgeTypeId identifies a unit, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

The UnitTypeId class offers unit identifiers.

#### Reference

UnitUtils Class

Autodesk.Revit.DB Namespace